name: "drug-search"
max_batch_size: 100
backend: "python"
input[{
	name: "input_text"
    data_type: TYPE_STRING
	dims: [-1]
},
{
	name: "filter1"
    data_type: TYPE_BOOL
	dims: [1]
},
{
	name: "add_pmids1"
    data_type: TYPE_BOOL
	dims: [1]
}
]
output[{
	name: "model_output"
	data_type: TYPE_STRING
	dims: [1]
}
]

instance_group[{
	count: 1
	kind: KIND_CPU
}]

dynamic_batching{}